app/views/posts/_form.html.erb

    <%= f.label :categories %>
    <%= f.select :category_ids, Category.all.collect {|x| [x.name, x.id]}, {}, :multiple => true %>
---
SELECT "categories".* FROM "categories"