app/views/posts/_post.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "post_categories" ON "categories"."id" = "post_categories"."category_id" WHERE "post_categories"."post_id" = ?  [["post_id", 1]]
---
  <div class="span8 well">
    <% post.categories.each do |category| %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
      <span>
        <a href=<%= post_path(post) %>> <%= post.comments.count %> comments </a>