app/views/posts/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "post_categories" ON "categories"."id" = "post_categories"."category_id" WHERE "post_categories"."post_id" = ?  [["post_id", 1]]
---
<h5>Categories</h5>
<% @post.categories.each do |category| %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
  <h5>Comments:</h5>
  <% @post.comments.each do |comment| %>