app/controllers/categories_controller.rb

	def show
		@category = Category.find_by slug: params[:id]
---
SELECT "categories".* FROM "categories" WHERE "categories"."slug" = '1' LIMIT 1

	def create
		@category = Category.new(post_params)
			if @category.save
---
INSERT INTO "categories" ("created_at", "name", "slug", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 24 Jul 2013 11:31:25 UTC +00:00], ["name", "Finance"], ["slug", "finance"], ["updated_at", Wed, 24 Jul 2013 11:31:25 UTC +00:00]]