app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'google-developers' LIMIT 1
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Nice site."], ["created_at", Wed, 10 Jul 2013 06:47:17 UTC +00:00], ["post_id", 1], ["updated_at", Wed, 10 Jul 2013 06:47:17 UTC +00:00], ["user_id", 1]]
---
	def create
		@post = Post.find_by slug: params[:post_id]
		@comment = @post.comments.build(comment_params)
		# if used @comment = Comment.new(comment_params) could call after @comment.post_id = @post.id
		@comment.user = current_user

		if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 20 Jul 2013 11:15:54 UTC +00:00], ["updated_at", Sat, 20 Jul 2013 11:15:54 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 1], ["voteable_type", "Comment"]]
---
	def vote
		#set up the comment, because there is no set_post before_filter like in post_controller
		@comment = Comment.find(params[:id])

		Vote.create(voteable: @comment, creator: current_user, vote: params[:vote])