app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params) #setting up the object in memory
    @post.user = current_user

      if @post.save #trigger the object into the database, if it passes validations
---
INSERT INTO "posts" ("created_at", "description", "slug", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def vote
    #strong params is not active, because we are not mass assigning here, :vote is just being parsed.
    #parsing one value is allowed

    #if current_user.voted? @post
      #flash[:notice] = "You've already voted on that post."
      #redirect_to root_path
    #else

    Vote.create(voteable: @post, creator: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 20 Jul 2013 10:32:49 UTC +00:00], ["updated_at", Sat, 20 Jul 2013 10:32:49 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]

  def set_post
    @post = Post.find_by slug: params[:id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'rvm-ruby-version-manager' LIMIT 1