app/views/layouts/_navigation.html.erb

</a>  <ul class='dropdown-menu'>
  <% Category.all.each do |c| %>
---
SELECT "categories".* FROM "categories"